byYorick/hydro2.0/firmware/test_node/sdkconfig.defaults
# Конфигурация для тестовой ноды

# Target
CONFIG_IDF_TARGET="esp32s3"

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# MQTT
CONFIG_MQTT_PROTOCOL_311=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Оптимизация памяти для уменьшения использования DRAM
CONFIG_SPIRAM=n

# Оптимизация heap
CONFIG_HEAP_POISONING_COMPREHENSIVE=n
CONFIG_HEAP_POISONING_LIGHT=n
CONFIG_HEAP_POISONING_DISABLED=y
CONFIG_HEAP_TRACING_OFF=y

# Оптимизация логов
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y

# Оптимизация компонентов
CONFIG_ESP_ERR_TO_NAME_LOOKUP=n
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Local UI: ILI9341 + LVGL + encoder (pins from hydro1.0)
CONFIG_TEST_NODE_UI_ENABLE=y
CONFIG_TEST_NODE_LCD_H_RES=240
CONFIG_TEST_NODE_LCD_V_RES=320
CONFIG_TEST_NODE_LCD_BUFFER_LINES=40
CONFIG_TEST_NODE_LCD_PIXEL_CLOCK_HZ=20000000
CONFIG_TEST_NODE_LCD_RGB_ORDER_BGR=y
CONFIG_TEST_NODE_LCD_SWAP_XY=n
CONFIG_TEST_NODE_LCD_MIRROR_X=n
CONFIG_TEST_NODE_LCD_MIRROR_Y=y
CONFIG_TEST_NODE_LCD_INVERT_COLORS=n
CONFIG_TEST_NODE_LCD_PIN_SCLK=12
CONFIG_TEST_NODE_LCD_PIN_MOSI=11
CONFIG_TEST_NODE_LCD_PIN_MISO=-1
CONFIG_TEST_NODE_LCD_PIN_DC=9
CONFIG_TEST_NODE_LCD_PIN_RST=14
CONFIG_TEST_NODE_LCD_PIN_CS=10
CONFIG_TEST_NODE_LCD_PIN_BK_LIGHT=15
CONFIG_TEST_NODE_LCD_BK_LIGHT_ON_LEVEL=1
CONFIG_TEST_NODE_ENCODER_PIN_A=5
CONFIG_TEST_NODE_ENCODER_PIN_B=4
CONFIG_TEST_NODE_ENCODER_PIN_SW=6

# LVGL optimization for firmware build size/time
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_12=y
